<?php

/*
|--------------------------------------------------------------------------
| Web Routes
|--------------------------------------------------------------------------
|
| Here is where you can register web routes for your application. These
| routes are loaded by the RouteServiceProvider within a group which
| contains the "web" middleware group. Now create something great!
|
*/

Route::get('/', function () {
    return view('welcome');
});

/**
* 后台路由组
*/
Route::group(['prefix' => 'admin'], function() {
    Route::get('/', 'Admin\IndexController@index'); // 后台首页
    /**
    *   +-------------------------------------------------------
    *   唐荣博 
    *   +-------------------------------------------------------
    */

    /** 结束
    *   +-------------------------------------------------------
    */




    /**
    *   +-------------------------------------------------------
    *   刘贵泽 
    *   +-------------------------------------------------------
    */
    //显示分类列表
    Route::get('types', 'Admin\TypesController@index'); //显示分类列表

    //添加顶级分类
    Route::get('types/add', 'Admin\TypesController@add'); //显示添加顶级分类页面
    Route::post('types/store', 'Admin\TypesController@store'); //传递顶级分类
    
    Route::post('types/del', 'Admin\TypesController@del');
 

 

    /** 结束
    *   +-------------------------------------------------------
    */




    /**
    *   +-------------------------------------------------------
    *   周双峰 
    *   +-------------------------------------------------------
    */  


    /** 结束
    *   +-------------------------------------------------------
    */




    /**
    *   +-------------------------------------------------------
    *   宋奕 
    *   +-------------------------------------------------------
    */


    /**  结束
    *   +-------------------------------------------------------
    */



});


